Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: For that reason, when the body of the method performs some kind of blocking IO operation (or even some CPU bound operation that requires time to complete), the request needs to be offloaded to a worker thread. In RESTEasy Reactive that is done declaratively using the `@Blocking` annotation - no reactive programming or complex Java concurrency related code is needed. Quarkus also warns you when you attempt to use blocking IO on an IO thread. If however the method body performs non-blocking IO (or some CPU bound operation that completes very quickly) then RESTEasy Reactive can continue to serve the entire request on the IO thread.
ja_jp: そのため、メソッドの本体が何らかのブロッキング IO 操作 (あるいは完了までに時間を要する CPU バインド操作) を実行する場合、リクエストはワーカースレッドにオフロードされる必要があります。RESTEasy Reactiveでは、 `@Blocking` アノテーションを使用して宣言的に行われます。Quarkus は、IO スレッドでブロッキング IO を使用しようとした場合にも警告します。しかし、メソッド本体がノンブロッキング IO (または非常に速く完了するCPUバインド操作) を実行する場合、RESTEasy Reactive は、IO スレッド上でリクエスト全体を提供し続けることができます。

source: For the AWS HTTP API you can inject the AWS variables `com.amazonaws.services.lambda.runtime.Context` and `com.amazonaws.services.lambda.runtime.events.APIGatewayV2HTTPEvent`. Here is an example:
ja_jp: AWS HTTP APIでは、AWS変数 `com.amazonaws.services.lambda.runtime.Context` および `com.amazonaws.services.lambda.runtime.events.APIGatewayV2HTTPEvent` を注入することができます。以下はその例です。

source: For the AWS REST API you can inject the AWS variables `com.amazonaws.services.lambda.runtime.Context` and `io.quarkus.amazon.lambda.http.model.AwsProxyRequestContext`. Here is an example:
ja_jp: AWS REST APIでは、AWS変数 `com.amazonaws.services.lambda.runtime.Context` と `io.quarkus.amazon.lambda.http.model.AwsProxyRequestContext` を注入することができます。以下はその例です。

source: For the DER format, pass DER-encoded CRLs.
ja_jp: DER フォーマットの場合、DER でエンコードされた CRL を渡します。

source: For the Developer's code and libraries, they need to consider particular cases when utilizing SnapStart:
ja_jp: 開発者のコードやライブラリに対して、SnapStartを利用する際には、特定のケースを考慮する必要があります:

source: For the Elasticsearch Java client, add the following dependency to your build file:
ja_jp: Elasticsearch Javaクライアントについては、以下の依存関係をビルドファイルに追加してください:

source: For the Elasticsearch high level client, add:
ja_jp: Elasticsearchの高レベルクライアントの場合は、以下を追加します。

source: For the Elasticsearch low level REST client, add the following dependency to your build file:
ja_jp: Elasticsearch 低レベルRESTクライアントについては、以下の依存関係をビルドファイルに追加してください:

source: For the Elasticsearch low level client, add:
ja_jp: Elasticsearchの低レベルクライアントの場合は、以下を追加します。

source: For the Observer to work, you need to enable events. In `application.properties`, add the following: `quarkus.smallrye-graphql.events.enabled=true`.
ja_jp: Observerを動作させるには、イベントを有効にする必要があります。 `application.properties` で、以下を追加します: `quarkus.smallrye-graphql.events.enabled=true` 。

source: For the PKCS#7 format, pass the `SignedData` object, where the only significant field is `crls`.
ja_jp: PKCS#7 フォーマットの場合、`SignedData` オブジェクトを渡します。この場合、重要なフィールドは `crls` だけです。

source: For the WebSocket server to accept the `Authorization` passed as a sub-protocol, we must:
ja_jp: WebSocket サーバーがサブプロトコルとして渡された `Authorization` を受け入れるには、次の操作を行う必要があります。

source: For the `@ConfigProperty` annotation, we now validate the `defaultValue` member against the field declaration for some added safety.
ja_jp: `@ConfigProperty` アノテーションでは、安全性を高めるために、 `defaultValue` のメンバをフィールド宣言に対して検証するようにしました。

source: For the `ExtensionsService` REST Client interface defined above, an example use of `@ClientExceptionMapper` would be:
ja_jp: 上記で定義された `ExtensionsService` REST Client インターフェイスの場合、 `@ClientExceptionMapper` の使用例は次のようになります。

source: For the `SecurityIdentity` injection in this example to work, you must activate the `SecurityIdentity` propagation:
ja_jp: この例で `SecurityIdentity` のインジェクションが機能するには、 `SecurityIdentity` の伝播をアクティブにする必要があります:

source: For the `stateless` approach, Quarkus allows users to configure a session cookie encryption key, fallbacks to the client secret and finally to a generated secure random key to apply a JSON Web Encryption (JWE) to encrypt a generated content encryption key with the symmetric `A256GCMKW` algorithm and the `A256GCM` algorithm to encrypt the actual session cookie content.
ja_jp: `stateless` (ステートレス) なアプローチの場合、Quarkus は、ユーザーがセッションクッキーの暗号化キーを設定できるようにします。クライアントシークレットにフォールバックし、最終的には生成されたセキュアなランダムキーにフォールバックして、JSON Web Encryption (JWE) を適用し、対称型の `A256GCMKW` アルゴリズムで生成されたコンテンツ暗号化キーを暗号化し、`A256GCM` アルゴリズムで実際のセッションクッキーの内容を暗号化します。

source: For the best development experience, we recommend applying the following configuration settings to your Kafka broker:
ja_jp: 最高の開発環境を実現するために、Kafkaブローカーに以下の構成設定を適用することをお勧めします:

source: For the broker to advertise its externally accessible address to clients, it requires an additional file `kafka.sh` as described in xref:compose-dev-services.adoc#exposing-port-mappings-to-running-containers[Exposing port mappings to running containers].
ja_jp: ブローカーがその外部からアクセス可能なアドレスをクライアントにアドバタイズするには、xref:compose-dev-services.adoc#exposing-port-mappings-to-running-containers[実行中のコンテナーへのポートマッピングの公開] に記述されているように、追加のファイル `kafka.sh` が必要です。

source: For the console handler, the property is `quarkus.log.console.format`.
ja_jp: コンソールハンドラの場合、プロパティは `quarkus.log.console.format` です。

source: For the default tenant, the `TenantFeature` qualifier is optional.
ja_jp: デフォルトのテナントの場合、 `TenantFeature` 修飾子は任意です。

source: For the default tenant, the `Tenant` qualifier is optional.
ja_jp: デフォルトのテナントの場合、 `Tenant` 修飾子は任意です。

source: For the dynamic client, the model classes are optional, because we can work with abstract representations of the GraphQL types and documents. The client API interface is not needed at all.
ja_jp: ダイナミッククライアントでは、GraphQLのタイプやドキュメントの抽象的な表現を扱うことができるため、モデルクラスはオプションとなります。また、クライアントのAPIインターフェースは全く必要ありません。

source: For the exhaustive list of features and configuration options, check the xref:kafka.adoc[Reference guide for Apache Kafka Extension].
ja_jp: 機能と設定オプションの完全なリストについては、xref:kafka.adoc[Apache Kafka エクステンションのリファレンスガイド] を確認してください。

source: For the exhaustive list of features and configuration options, check the xref:pulsar.adoc[Reference guide for Apache Pulsar Extension].
ja_jp: 機能と設定オプションの完全なリストについては、xref:pulsar.adoc[Apache Pulsar エクステンションのリファレンスガイド] を確認してください。

source: For the exposed metrics to contain any actual values, a metric collection must be enabled internally by the Agroal mechanisms. By default, this metric collection mechanism is enabled for all datasources when a metrics extension is present, and metrics for the Agroal extension are enabled.
ja_jp: 公開されたメトリクスが実際の値を含むためには、Agroal メカニズムによって内部的にメトリクス収集が有効になっている必要があります。 デフォルトでは、メトリクス・エクステンションが存在し、Agroal エクステンションのメトリクスが有効になっている場合、このメトリクス収集メカニズムはすべてのデータソースに対して有効になります。

source: For the exposed metrics to contain any actual values, it is necessary that metric collection is enabled internally by Agroal mechanisms. By default, this metric collection mechanism gets turned on for all data sources if a metrics extension is present and metrics for the Agroal extension are enabled. If you want to disable metrics for a particular data source, this can be done by setting `quarkus.datasource.jdbc.enable-metrics` to `false` (or `quarkus.datasource.<datasource name>.jdbc.enable-metrics` for a named datasource). This disables collecting the metrics as well as exposing them in the `/q/metrics` endpoint, because it does not make sense to expose metrics if the mechanism to collect them is disabled.
ja_jp: 公開されたメトリクスに実際の値が含まれるようにするには、メトリクス収集が Agroal メカニズムによって内部的に有効化されている必要があります。デフォルトでは、メトリクス拡張が存在し、Agroal 拡張のメトリクスが有効になっている場合に、このメトリック収集メカニズムはすべてのデータソースに対してオンになります。特定のデータソースのメトリクスを無効にしたい場合は、 `quarkus.datasource.jdbc.enable-metrics` を `false` (名前付きデータソースの場合は `quarkus.datasource.<datasource name>.jdbc.enable-metrics`) に設定することで行うことができます。これは、メトリクスを収集するメカニズムが無効化されている場合は、メトリクスの公開は意味がありません。そのため、 `/q/metrics` エンドポイントでの公開と同様に、メトリクスの収集を無効化します。

source: For the expression `cdi:personService.findPerson(10).name`, the implementation class of the injected bean must either declare the `findPerson` method or a matching <<template_extension_methods,template extension method>> must exist.
ja_jp: `cdi:personService.findPerson(10).name` 式では、注入された Bean の実装クラスは `findPerson` メソッドを宣言するか、一致する <<template_extension_methods,template extension method>> が存在する必要があります。

source: For the expression `inject:foo.price`, the implementation class of the injected bean must either have the `price` property (e.g. a `getPrice()` method) or a matching <<template_extension_methods,template extension method>> must exist.
ja_jp: `inject:foo.price` 式では、注入された Bean の実装クラスに `price` プロパティー (例: `getPrice()` メソッド) があるか、一致する<<template_extension_methods,template extension method>> が存在する必要があります。

source: For the expression `inject:foo.price`, the implementation class of the injected bean must either have the `price` property (e.g. a `getPrice()` method) or a matching xref:template_extension_methods[template extension method] must exist.
ja_jp: 表現 `inject:foo.price` については，注入されたBeanの実装クラスは， `price` プロパティ(例えば， `getPrice()` メソッド)をもつか，一致する xref:template_extension_methods[テンプレート拡張メソッド] が存在する必要があります。

source: For the first variant, two additional files are needed in your application's root directory:
ja_jp: 最初のバリエーションでは、アプリケーションのルートディレクトリに 2 つの追加ファイルが必要です：

source: For the full list of available metric names, please refer to the link:https://docs.datastax.com/en/developer/java-driver/latest/manual/core/configuration/reference/[driver settings reference] page; search for the `advanced.metrics` section. Also, Cassandra driver metrics are covered in detail in the https://docs.datastax.com/en/developer/java-driver/latest/manual/core/metrics/[driver manual].
ja_jp: 使用可能なメトリクス名の完全なリストについては、 link:https://docs.datastax.com/en/developer/java-driver/latest/manual/core/configuration/reference/[Driver Setting Reference] ページを参照してください。このページで `advanced.metrics` セクションを検索してください。また、Cassandra ドライバーのメトリクスについては、 https://docs.datastax.com/en/developer/java-driver/latest/manual/core/metrics/[ドライバーマニュアル] で詳しく説明されています。

source: For the implemented services, Quarkus gRPC exposes health information in the following format:
ja_jp: 実装されたサービスでは、Quarkus gRPCは以下の形式でヘルスチェックを公開しています。

source: For the in-code access to the datasource, obtain it as any other bean as follows:
ja_jp: データソースへのコード内アクセスは、他のBeanと同様に以下のように取得します：

source: For the last 25 years, Java has performed for organizations across the world but you've never seen anything like this. We'll cover all the classics like "Start Me Up" and "Living' on a VM" and some new jams like "Stairway to Native" and "Sweet JPA of Mine" and more.
ja_jp: 過去 25 年間、Java は世界中の組織で活躍してきましたが、このようなものは見たことがないでしょう。「Start Me Up」や「Living' on a VM」のようなクラシックな曲から、「Stairway to Native」や「Sweet JPA of Mine」のような新しい曲まで、盛りだくさんです。

source: For the last step we will add the excellent https://github.com/eirslett/frontend-maven-plugin[frontend-maven-plugin] to our pom.xml that will trigger these React build phases from a normal maven build. Adjust the npm and node versions to match your locally installed ones. The maven install phase would actually install these two packages which can be handy for a CI/CD build or when starting with this project.
ja_jp: 最後のステップでは、優れた link:https://github.com/eirslett/frontend-maven-plugin[frontend-maven-plugin]を pom.xml に追加して、通常の maven ビルドから React のビルドフェーズを起動します。npmとnodeのバージョンを、ローカルにインストールされているものに合わせて調整します。mavenのインストールフェーズでは、実際にこれらの2つのパッケージがインストールされますが、これはCI/CDビルドやこのプロジェクトの起動時に便利です。

source: For the logout to work from OIDC DevUI, the Auth0 application's list of allowed logout callbacks has to be updated to include the OIDC DevUI endpoint:
ja_jp: OIDC DevUI からのログアウトが機能するためには、Auth0 アプリケーションの許可されたログアウトコールバックのリストを更新して、OIDC DevUI エンドポイントを含める必要があります。

source: For the most part, we hope this will be transparent. We discovered some very inconsistent path handling along the way, which lead us to believe that many (or even most) of these values are never customized.
ja_jp: ほとんどの部分では、これが透明であることを願っています。途中で非常に一貫性のないパス処理を発見し、これらの値の多く（あるいはほとんど）がカスタマイズされることはないと考えさせられました。

source: For the news below - give it a read and if you feel something is missing or have an article coming out for future Quarkus Newsletter install the https://github.com/quarkusio/url2quarkuspub[bookmarklet] on your laptop and phone to easily submit a story. If you prefer the manual way please https://github.com/quarkusio/quarkusio.github.io/issues[open an issue] with a short description and a url.
ja_jp: 以下のニュースを読んで、もし、何かが欠けていると感じたり、将来のQuarkus ニュースレターのために記事をお持ちの場合は、 link:https://github.com/quarkusio/url2quarkuspub[ブックマークレット] をラップトップやスマートフォンにインストールして、簡単に記事を投稿することができます。あなたが手動の方法を好む場合は、短い説明とURLを link:https://github.com/quarkusio/quarkusio.github.io/issues[Issueを登録] してください。

source: For the past 25 years, Java has been the dominant framework for developers creating enterprise applications. During that same time, developers continue to support their respective communities and countries each pay period through taxes.
ja_jp: 過去25年間にわたって、Javaはエンタープライズアプリケーションを作成する開発者にとって圧倒的なフレームワークとなっています。その間、開発者は税金を払って、それぞれのコミュニティや国を支え続けてきました。

source: For the perfomance reasons the context (e.g., CDI or security context) is not propagated into each health check invocation. However, if you need to enable this functionality you can set the config property `quarkus.smallrye-health.context-propagation=true` to allow the context propagation into every health check call.
ja_jp: パフォーマンス上の理由から、コンテキスト（CDIまたはセキュリティ・コンテキストなど）は、各ヘルスチェック呼び出しに伝搬されません。ただし、この機能を有効にする必要がある場合は、設定プロパティ（ `quarkus.smallrye-health.context-propagation=true` ）を設定して、すべてのヘルスチェック呼び出しにコンテキストが伝搬されるようにすることができます。

source: For the published metrics to report values, Agroal must enable its internal metrics collection. By default, Agroal enables internal metrics collection for all datasources when a metrics extension is present and `quarkus.datasource.metrics.enabled` is set to `true`.
ja_jp: 公開されたメトリクスが値を報告するためには、Agroal が内部メトリクス収集を有効にする必要があります。 デフォルトでは、メトリクスエクステンションが存在し、 `quarkus.datasource.metrics.enabled` が `true` に設定されている場合、Agroal はすべてのデータソースに対して内部メトリクス収集を有効にします。

source: For the purpose of this demonstration, let's import an initial dataset.
ja_jp: このデモの目的のために、初期データセットをインポートしてみましょう。

source: For the purpose of this tutorial, you may want to check manually, that the playbook did indeed deployed the app properly. Here is the few ways to do so.
ja_jp: このチュートリアルの目的のために、プレイブックが本当にアプリを正しくデプロイしたかどうか、手動でチェックしたいと思うかもしれません。そのためのいくつかの方法を紹介しましょう。

source: For the purposes of these examples I am going to assume we have an endpoint that looks like the following:
ja_jp: これらの例では、以下のようなエンドポイントを想定しています:

source: For the purposes of this guide, we also need to remove the configuration that starts the embedded WireMock server that stubs REST client responses so the tests actually propagate calls to the https://stage.code.quarkus.io/api. Update the test file `src/test/java/org/acme/rest/client/ExtensionsResourceTest.java` and remove the line:
ja_jp: このガイドの目的から、RESTクライアントの応答をスタブ化する組み込み型のWireMockサーバーを起動する設定を削除して、テストが実際に https://stage.code.quarkus.io/api への呼び出しを伝播するようにする必要もあります。テストファイル `src/test/java/org/acme/rest/client/ExtensionsResourceTest.java` を更新し、次の行を削除します。

source: For the sake of simplicity, everything (except Consul) will be running in the same Quarkus application. Of course, each component will run in its own process in the real world.
ja_jp: 簡略化のため、（Consulを除く）すべてのコンポーネントは、同じQuarkusアプリケーション内で実行されます。もちろん、実際には各コンポーネントはそれぞれのプロセスで実行されます。

source: For the sake of simplicity, everything will be deployed in the same namespace of the Kubernetes cluster.
ja_jp: 簡単にするために、すべてが Kubernetes クラスターの同じ名前空間にデプロイされます。

source: For the sam template files, add the following to the YAML function Properties.
ja_jp: SAM テンプレートファイルの場合は、YAML の Function Properties に以下を追加します。

source: For the test class here is an example:
ja_jp: テストクラスの例です:

source: For the tests you will also need REST Assured. Add it to the build file:
ja_jp: テストのためには、REST Assuredも必要です。これをビルドファイルに追加します。

source: For the time being, returning Multipart data is limited to be blocking endpoints.
ja_jp: 当面、マルチパートデータを返すことはエンドポイントをブロックすることに限定されます。

source: For these operations, you can express the update document the same way you express your queries, here are some examples:
ja_jp: これらの操作では、クエリを表現するのと同じように、更新文書を表現することができます。以下に例を示します。

source: For these reasons, enabling caching is only suitable when certain assumptions can be made: we strongly recommend that only entities, collections and queries which never change are cached. Or at most, that when indeed such an entity is mutated and allowed to be read out of date (stale) this has no impact on the expectations of the application.
ja_jp: これらの理由から、ある種の仮定が成り立つ場合にのみキャッシュを有効にすることが適しています。私たちは、変化しないエンティティ、コレクション、およびクエリのみをキャッシュすることを強く推奨します。あるいは、そのようなエンティティが実際に変更され、古くなった（stale）ものを読み取ったとしても、アプリケーションの期待値に影響を与えないようにする必要があります。

source: For third-party dialects, the expected value is the fully-qualified class name, for example `com.acme.hibernate.AcmeDbDialect`.
ja_jp: サードパーティーのダイアレクトの場合、期待される値は完全修飾クラス名です。 たとえば `com.acme.hibernate.AcmeDbDialect` などです。

source: For this and other properties you can use with the extension, Please refer to:
ja_jp: このプロパティーやエクステンションで使用できるその他のプロパティーについては、以下を参照してください。

source: For this approach to work, the integration tests must not be skipped.
ja_jp: このアプローチを機能させるには、統合テストをスキップしてはいけません。

source: For this example Quarkus build will generate the following `ServiceBinding` resources:
ja_jp: この例では、Quarkus のビルドにより、次の `ServiceBinding` リソースが生成されます。

source: For this example project, we will create four endpoints, one for Quarkus REST (Jakarta REST), one for Undertow (Servlet), one for Reactive routes and one for xref:funqy-http.adoc[Funqy HTTP].
ja_jp: このサンプルプロジェクトでは、Quarkus REST（Jakarta REST）、Undertow（Servlet）、Reactive routes、 xref:funqy-http.adoc[Funqy] HTTPの4つのエンドポイントを作成します。

source: For this example project, we will create four endpoints, one for RESTEasy (JAX-RS), one for Undertow (Servlet), one for Reactive routes and one for xref:funqy-http.adoc[Funqy HTTP].
ja_jp: このサンプルプロジェクトでは、RESTEasy（JAX-RS）用、Undertow（Servlet）用、Reactive routes用、 link:funqy-http.html[Funqy HTTP] 用の4つのエンドポイントを作成します。

source: For this example project, we will create four endpoints, one for RESTEasy Reactive (Jakarta REST), one for Undertow (Servlet), one for Reactive routes and one for xref:funqy-http.adoc[Funqy HTTP].
ja_jp: 今回のサンプルプロジェクトでは、RESTEasy Reactive（Jakarta REST）用、Undertow（Servlet）用、Reactive routes用、xref:funqy-http.adoc[Funqy HTTP] 用の4つのエンドポイントを作成することにします。

source: For this example project, we will create four functions, one `HttpFunction`, one `BackgroundFunction` (Storage event), one `RawBackgroundFunction` (PubSub event) and one `CloudEventsFunction` (storage event using the Cloud Events specification).
ja_jp: このプロジェクトの例では、 `HttpFunction` 、 `BackgroundFunction` （ストレージイベント）、 `RawBackgroundFunction` （PubSubイベント）、 `CloudEventsFunction` （Cloud Events 仕様を使用したストレージイベント）の4つの関数を作成します。

source: For this example project, we will create three functions, one `HttpFunction`, one `BackgroundFunction` (Storage event) and one `RawBackgroundFunction` (PubSub event).
ja_jp: このプロジェクトの例では、 `HttpFunction` 、 `BackgroundFunction` (ストレージイベント)、 `RawBackgroundFunction` (PubSubイベント)の3つの関数を作成します。

source: For this example we focus on the rule format backed by DRL (Drools Rule Language), but the same business logic may be expressed with other supported Kogito knowledge formats as well.
ja_jp: この例では、DRL（Drools Rule Language）に裏付けられたルール・フォーマットに焦点を当てていますが、同じビジネス・ロジックは、サポートされている他のKogito知識フォーマットでも表現できます。

source: For this example we focus on using the https://drools.org/learn/dmn.html[DMN (Decision Model and Notation)] open standard to describe the decision rules.
ja_jp: この例では、オープンスタンダードの link:https://drools.org/learn/dmn.html[DMN（Decision Model and Notation）]を使って意思決定ルールを記述することに焦点を当てています。

source: For this example, we'll use the Prometheus registry.
ja_jp: この例では、Prometheus のレジストリーを使用します。

source: For this injection point the required type is `Service` and no additional qualifiers are declared.
ja_jp: このインジェクションポイントに必要なタイプは `Service` であり、追加の修飾子は宣言されていません。

source: For this kind of use case, we recommend using marker interfaces or methods instead of annotations.
ja_jp: このようなユースケースには、アノテーションの代わりにマーカーインターフェースまたはメソッドを使用することをお勧めします。

source: For this reason, such properties always require their dotted version name in another source (the value can be left empty) to disambiguate the Environment Variable name. It will provide additional information to perform a two-way conversion and match the property names together.
ja_jp: このため、このようなプロパティは、環境変数名を曖昧にしないために、別のソースでのドット付きバージョン名（値は空のままでもかまいません）を常に必要とします。これは、双方向変換を実行し、プロパティ名を一致させるための追加情報を提供します。

source: For this reason, such properties always require their dotted version name in another source to disambiguate the Environment Variable name. It will provide additional information to perform a two-way conversion and match the property names together.
ja_jp: このため、このようなプロパティは常に、環境変数名を曖昧にしないために、別のソースでのドット付きバージョン名を必要とします。 これは、双方向変換を実行し、プロパティ名を一緒に一致させるための追加情報を提供します。

source: For this reason, the REST Client includes a property named `disable-default-mapper` which can be used to disable the default mapper when using a REST client in a declarative manner.
ja_jp: このため、REST Client には、宣言的な方法で REST クライアントを使用するときにデフォルトのマッパーを無効にするために使用できる `disable-default-mapper` というプロパティーが含まれています。

source: For this reason, you should either create branches for 3.27 and 3.28+ versions of the extension, or just build against 3.28. If you build against 3.28, you will need to manually set the minimum Quarkus version in the extension metadata, so that the Quarkus tooling recognises the extension as compatible with 3.27.
ja_jp: このため、エクステンションの 3.27 用と 3.28+ 用のブランチを作成するか、単に 3.28 に対してビルドする必要があります。 3.28 に対してビルドする場合は、Quarkus ツールがそのエクステンションを 3.27 と互換性があると認識できるように、エクステンションのメタデータで最小 Quarkus バージョンを手動で設定する必要があります。

source: For this test, since we're testing both the provided callback endpoint, which updates users in its `WebAuthnUserProvider` and the manual `LoginResource` endpoint, which deals with users manually, we need to override the `WebAuthnUserProvider` with one that doesn't update the `scooby` user:
ja_jp: このテストでは、その `WebAuthnUserProvider` のユーザーを更新する提供されたコールバックエンドポイントと、ユーザーを処理する自作した `LoginResource` エンドポイントの両方をテストしているので、 `WebAuthnUserProvider` を `scooby` ユーザーを更新しないものに上書きする必要があります。

source: For this test, since we're testing both the provided callback endpoint, which updates users in its link:{webauthn-api}/io/quarkus/security/webauthn/WebAuthnUserProvider.html[`WebAuthnUserProvider`] and the manual `LoginResource` endpoint, which deals with users manually, we need to override the link:{webauthn-api}/io/quarkus/security/webauthn/WebAuthnUserProvider.html[`WebAuthnUserProvider`] with one that doesn't update the `scooby` user:
ja_jp: このテストでは、提供されたコールバックエンドポイント (link:{webauthn-api}/io/quarkus/security/webauthn/WebAuthnUserProvider.html[`WebAuthnUserProvider`] 内でユーザーを更新) と、 ユーザーを手動で処理する手動の `LoginResource` エンドポイントの両方をテストするため、 `scooby` ユーザーを更新しない link:{webauthn-api}/io/quarkus/security/webauthn/WebAuthnUserProvider.html[`WebAuthnUserProvider`] に オーバーライドする必要があります。

source: For this to work we simply have to enable Homebrew in the JReleaser plugin configuration like so:
ja_jp: これを機能させるには、次のように JReleaser プラグイン設定で Homebrew を有効にする必要があります。

source: For this type of application, Quarkus relies on well-known standards such as JAX-RS, JPA and MicroProfile Rest Client, but also Hibernate with Panache to simplify interactions with databases.
ja_jp: この種のアプリケーションでは、QuarkusはJAX-RS、JPA、MicroProfile Rest Clientなどのよく知られた標準に加えて、データベースとのやり取りを簡素化するためにHibernate with Panacheにも依存しています。
